app/views/questions/show.html.erb


<% if @question.answers.empty? %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT 1 AS one FROM "answers" WHERE "answers"."question_id" = ? LIMIT ?  [["question_id", 2], ["LIMIT", 1]]


<%@question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]

    <%= form.label :questiongoer %><br>
    <%= form.collection_select :questiongoer, Questiongoer.all, :id, :name%>
---
SELECT "questiongoers".* FROM "questiongoers"