app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @answer = Question.find(params[:question_id]).answers.find(params[:id])

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "risposta17"], ["updated_at", "2021-07-12 22:14:58.448106"], ["id", 1]]
---
   def update
    authorize! :update, Answer, message: "You are not authorized!"
    @answer = Question.find(params[:question_id]).answers.find(params[:id])
    if current_user.email==@answer.author
      if @answer.update(answer_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("author", "body", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "user@gmail.com"], ["body", "Risposta1"], ["question_id", 1], ["created_at", "2021-07-13 06:42:49.074718"], ["updated_at", "2021-07-13 06:42:49.074718"]]
---
  def create
    authorize! :create, Answer, message: "You are not authorized!"
    @question = Question.find(params[:question_id])


    @answer = @question.answers.create(answer_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]
---
  def destroy
    authorize! :destroy, Answer, message: "You are not authorized!"
    @question = Question.find(params[:question_id])
    @answer = @question.answers.find(params[:id])
    if current_user.email==@question.author||current_user.coolness>=2
        @answer.destroy