app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "author", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sssss"], ["body", "ssssssssssss"], ["author", "prova@gmail.com"], ["date", "2021-07-10"], ["created_at", "2021-07-10 10:58:55.724021"], ["updated_at", "2021-07-10 10:58:55.724021"]]
---
  def create
    @question = Question.new(question_params)
    if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "questions" SET "body" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["body", "aaab"], ["updated_at", "2021-07-11 09:14:25.689478"], ["id", 1]]
---
 def update
    @question = Question.find(params[:id])
    if @question.update(question_params)