app/controllers/questiongoers_controller.rb

  def index
  	 @mvgs = Questiongoer.all
---
SELECT "questiongoers".* FROM "questiongoers"