app/controllers/users_controller.rb

  def index
    authorize! :index, User, message: "You are not authorized!"
    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    authorize! :create, User, message: "You are not authorized!"
      @user = User.find(params[:id])
      if current_user.email!=@user.email && current_user.coolness>@user.coolness
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "coolness" = ? WHERE "users"."id" = ?  [["updated_at", "2021-07-13 06:06:08.264722"], ["coolness", 2], ["id", 4]]

  def destroy
    authorize! :destroy, User, message: "You are not authorized!"
    @user = User.find(params[:id])
      if current_user.email!=@user.email && current_user.coolness>2
        @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]